In [1]:
import pandas as pd
import numpy as np

In [27]:
#creating dataframe 
a=np.arange(1,10,1)
b=np.arange(0,9,1)
name=pd.Series(["ABHINAYA","SUVARNA","BHAN","RAJITHA","CHERRY","RAKSHI","JAYASHANKAR","HARSHA","DEEPIKA"])
age=pd.Series([20,18,19,19,18,20,19,18,20])
gender=pd.Series(["F","F","F","F","F","F","M","M","F"])
dept=pd.Series(["CSE","EEE","MECH","CSE","CSE","CSE","EEE","MECH","CIVIL"])
dept_df=pd.DataFrame({"NAME":name,"AGE":age,"GENDER":gender,"DEPT":dept})
dept_df

          NAME  AGE GENDER   DEPT
0     ABHINAYA   20      F    CSE
1      SUVARNA   18      F    EEE
2         BHAN   19      F   MECH
3      RAJITHA   19      F    CSE
4       CHERRY   18      F    CSE
5       RAKSHI   20      F    CSE
6  JAYASHANKAR   19      M    EEE
7       HARSHA   18      M   MECH
8      DEEPIKA   20      F  CIVIL

In [39]:
#grouping based on department and then printing the first of all groups
gp1=dept_df.groupby("DEPT")
gp1.first()

           NAME  AGE GENDER
DEPT
CIVIL   DEEPIKA   20      F
CSE    ABHINAYA   20      F
EEE     SUVARNA   18      F
MECH       BHAN   19      F

In [40]:
#size of the above group
gp1.size()

DEPT
CIVIL    1
CSE      4
EEE      2
MECH     2
dtype: int64

In [42]:
#getting group
gp2=gp1.get_group("CSE")
gp2

       NAME  AGE GENDER DEPT
0  ABHINAYA   20      F  CSE
3   RAJITHA   19      F  CSE
4    CHERRY   18      F  CSE
5    RAKSHI   20      F  CSE

In [44]:
#getting group
gp3=gp1.get_group("MECH")
gp3

     NAME  AGE GENDER  DEPT
2    BHAN   19      F  MECH
7  HARSHA   18      M  MECH

In [48]:
#summing the ages of CSE dept
gp2.sum()

NAME      ABHINAYARAJITHACHERRYRAKSHI
AGE                                77
GENDER                           FFFF
DEPT                     CSECSECSECSE
dtype: object

In [49]:
#summing the ages of civil dept
gp4=gp1.get_group("CIVIL")
gp4.sum()

NAME      DEEPIKA
AGE            20
GENDER          F
DEPT        CIVIL
dtype: object